app/Controllers/dashboardController.php

    public function index()
    {
        // Vérifier si l'utilisateur est connecté
        if (!session()->has('user_id')) {
            // Si non connecté, rediriger vers la page de connexion
            return redirect()->to('/login');
        }

        // Récupérer les informations de l'utilisateur depuis la session
        $user_id = session()->get('user_id');

        // Charger les modèles
        $userModel = new UserModel();
        $compteModel = new CompteModel();

        // Récupérer les données de l'utilisateur
        $user = $userModel->find($user_id);
        $compte = $compteModel->where('compte_id', $user['compte_id'])->first(); // Récupérer les informations du compte
---
SELECT *
FROM `comptes`
WHERE `compte_id` = '16'
 LIMIT 1