app/Controllers/dashboardController.php

SELECT *
FROM `comptes`
WHERE `user_id` = '5'
 LIMIT 1
SELECT *
FROM `users`
WHERE `users`.`user_id` = '16'
---
    public function index()
    {
        // Simulate user session retrieval (e.g., user_id from session)
        $session = session();
        $userId = $session->get('user_id'); // Ensure user_id is set during login

        if (!$userId) {
            return redirect()->to('/login')->with('error', 'Please log in first.');
        }

        // Fetch user data
        $compteModel = new CompteModel();
        $user = $compteModel->where('user_id', $userId)->first();

        // Check if user exists
        if (!$user) {
            return redirect()->to('/login')->with('error', 'User not found.');