app/Controllers/etudReclamationsController.php

    private function isAuthorized()
    {
        if (!session()->has('user_id')) {
            return false;
        }

        $user_id = session()->get('user_id');
        $compteModel = new CompteModel();
        $compte = $compteModel->find($user_id);
---
SELECT *
FROM `comptes`
WHERE `comptes`.`compte_id` = '37'

    public function index()
    {
        if (!$this->isAuthorized()) {
            return redirect()->to('/login');
        }

        $user_id = session()->get('user_id');
        $reclamationModel = new ReclamationModel();
        $reclamations = $reclamationModel->where('student_id', $user_id)->findAll();
---
SELECT *
FROM `reclamations`
WHERE `student_id` = '37'