app/Controllers/examsListController.php

SELECT *
FROM `exams`
---
    public function index()
    {
        // Vérifier si l'utilisateur est connecté
        if (!session()->has('user_id')) {
            return redirect()->to('/login');
        }

        // Charger le modèle
        $examModel = new ExamModel();

        // Récupérer la liste des exams
        $exams = $examModel->findAll();