app/Controllers/examsListController.php

SELECT `exams`.*, `filieres`.`filiere_name`, `departements`.`departement_name`
FROM `exams`
JOIN `filieres` ON `exams`.`filiere_id` = `filieres`.`filiere_id`
JOIN `departements` ON `filieres`.`departement_id` = `departements`.`departement_id`
WHERE `exams`.`responsable_id` = '68'
---
    public function index()
    {
        // Vérifier si l'utilisateur est connecté
        if (!session()->has('user_id')) {
            return redirect()->to('/login');
        }

        // Récupérer l'ID du professeur connecté
        $responsable_id = session()->get('user_id');

        // Charger le modèle
        $examModel = new ExamModel();

        // Récupérer la liste des exams pour ce professeur avec les noms des filières et des départements
        $exams = $examModel->select('exams.*, filieres.filiere_name, departements.departement_name')
            ->join('filieres', 'exams.filiere_id = filieres.filiere_id')
            ->join('departements', 'filieres.departement_id = departements.departement_id')
            ->where('exams.responsable_id', $responsable_id)  // Filtrage par responsable_id
            ->findAll();