app/Controllers/loginController.php

    public function login()
    {
        // Récupérer les données du formulaire
        $email = $this->request->getPost('Email');
        $password = $this->request->getPost('password');

        // Charger le modèle pour interagir avec la base de données
        $userModel = new UserModel();

        // Vérifier si l'utilisateur existe
        $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'simo@example.com'
 LIMIT 1