app/Controllers/loginController.php

    public function login()
    {
        $validation = \Config\Services::validation();

        // Validation des données
        $validation->setRules([
            'Email' => 'required|valid_email',
            'password' => 'required|min_length[8]'
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            session()->setFlashdata('error', 'Invalid input data.');
            return redirect()->to('/login');
        }

        // Récupérer les données du formulaire
        $email = $this->request->getPost('Email');
        $password = $this->request->getPost('password');

        // Charger le modèle pour interagir avec la base de données
        $userModel = new UserModel();

        // Vérifier si l'utilisateur existe et récupérer son rôle
        $user = $userModel->select('users.*, comptes.role_id')
        ->join('comptes', 'comptes.compte_id = users.compte_id')
        ->where('users.email', $email)
            ->first();
---
SELECT `users`.*, `comptes`.`role_id`
FROM `users`
JOIN `comptes` ON `comptes`.`compte_id` = `users`.`compte_id`
WHERE `users`.`email` = 'hatim@gmail.com'
 LIMIT 1


                // Charger le modèle pour interagir avec les rôles
                $roleModel = new \App\Models\RoleModel();
                $role = $roleModel->find($role_id);
---
SELECT *
FROM `roles`
WHERE `roles`.`role_id` = '3'