app/Controllers/profilController.php

SELECT *
FROM `comptes`
WHERE `compte_id` = '2'
 LIMIT 1
---
    public function index()
    {
        // Récupérer l'ID de l'utilisateur connecté
        $userId = session()->get('user_id');

        if (!$userId) {
            return redirect()->to('/login'); // Rediriger si l'utilisateur n'est pas connecté
        }

        // Charger le modèle pour récupérer les informations du compte
        $compteModel = new CompteModel();
        $compte = $compteModel->where('compte_id', $userId)->first(); // Récupérer les données du compte