app/Controllers/profilController.php

    public function index()
    {
        $session = session();

        // Vérifiez si l'utilisateur est connecté
        if (!$session->has('user_id')) {
            return redirect()->to('/login')->with('error', 'Vous devez être connecté pour accéder à cette page.');
        }

        // Récupérez les informations de l'utilisateur depuis la base de données
        $compteModel = new CompteModel();
        $compte = $compteModel->where('user_id', $session->get('user_id'))->first();
---
SELECT *
FROM `comptes`
WHERE `user_id` = '16'
 LIMIT 1