app/Controllers/reclamationsController.php

SELECT *
FROM `comptes`
WHERE `comptes`.`compte_id` = '16'
---
    public function index()
    {
        // Vérification de l'authentification de l'utilisateur
        if (!session()->has('user_id')) {
            return redirect()->to('/login');
        }

        // Récupérer l'ID de l'utilisateur actuel et son rôle
        $user_id = session()->get('user_id');
        $compteModel = new CompteModel();
        $compte = $compteModel->find($user_id);