app/Controllers/registerController.php

SELECT *
FROM `comptes`
WHERE `email` = 'mery@gmail.com'
 LIMIT 1
SELECT *
FROM `users`
WHERE `email` = 'mery@gmail.com'
 LIMIT 1
---
    public function store()
    {
        $validation = \Config\Services::validation();

        // Validation rules
        $validation->setRules([
            'first_name'  => 'required|min_length[3]',
            'last_name'   => 'required|min_length[3]',
            'email'       => 'required|valid_email|is_unique[users.email]|is_unique[comptes.email]',
            'phone_number' => 'required|numeric|min_length[8]',
            'password'    => 'required|min_length[8]'
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            // If validation fails, display errors
            return view('register', [
                'validation' => $validation
            ]);
        }

        // Retrieve form data
        $firstName = $this->request->getPost('first_name');
        $lastName = $this->request->getPost('last_name');
        $email = $this->request->getPost('email');
        $phoneNumber = $this->request->getPost('phone_number');
        $password = password_hash($this->request->getPost('password'), PASSWORD_DEFAULT);

        // Check if the email already exists in both tables
        $compteModel = new CompteModel();
        $existingCompte = $compteModel->where('email', $email)->first();

        $userModel = new UserModel();
        $existingUser = $userModel->where('email', $email)->first();

INSERT INTO `comptes` (`first_name`, `last_name`, `email`, `password`, `phone_number`, `etat`, `role_id`) VALUES ('jordi', 'alba', 'jordi@xn--bara-2oa.com', '$2y$10$eGzvKa90hYInDPIqPAXahOddOS1ZElmt2W2YpO5e1TsN/lCZWXwdO', '0620419685', 'accepted', '2')
---
            'phone_number' => $phoneNumber,
            'etat'         => 1, // Default value for etat
        ];
        $compteModel->insert($compteData);

INSERT INTO `users` (`email`, `password`, `compte_id`, `user_id`, `created_at`, `updated_at`) VALUES ('admin@gmail.com', '$2y$10$dxbEKdEP2M/Wl6wJ2/A95.zVxAxZLJcC9TJQdpGfSgGa2OZgr85KG', 52, 52, '2025-01-20 21:14:41', '2025-01-20 21:14:41')
---
            'password'  => $password,
            'compte_id' => $compteId,
        ];
        $userModel->insert($userData);