app/Controllers/usersAddController.php

SELECT *
FROM `comptes`
WHERE `comptes`.`compte_id` = '40'
---
    public function index()
    {
        if (!session()->has('user_id')) {
            return redirect()->to('/login');
        }

        $user_id = session()->get('user_id');
        $compteModel = new CompteModel();
        $compte = $compteModel->find($user_id);