app/Controllers/usersListController.php

    public function index()
    {
        // Vérifier si l'utilisateur est connecté
        if (!session()->has('user_id')) {
            // Si non connecté, rediriger vers la page de connexion
            return redirect()->to('/login');
        }

        // Récupérer les informations de l'utilisateur depuis la session
        $user_id = session()->get('user_id');

        // Charger le modèle
        $compteModel = new CompteModel();

        // Récupérer les données du compte de l'utilisateur
        $compte = $compteModel->find($user_id); // Récupérer les informations du compte de l'utilisateur connecté
---
SELECT *
FROM `comptes`
WHERE `comptes`.`compte_id` = '16'