app/Models/compteModel.php

SELECT `comptes`.*, `roles`.`role_type`, `departements`.`departement_name`, `filieres`.`filiere_name`
FROM `comptes`
LEFT JOIN `roles` ON `roles`.`role_id` = `comptes`.`role_id`
LEFT JOIN `departements` ON `departements`.`departement_id` = `comptes`.`departement_id`
LEFT JOIN `filieres` ON `filieres`.`filiere_id` = `comptes`.`filiere_id`
---
    public function getAllComptesWithRoles()
    {
        return $this->select('comptes.*, roles.role_type, departements.departement_name, filieres.filiere_name')
            ->join('roles', 'roles.role_id = comptes.role_id', 'left')
            ->join('departements', 'departements.departement_id = comptes.departement_id', 'left') // Correction pour departements
            ->join('filieres', 'filieres.filiere_id = comptes.filiere_id', 'left') // Correction pour filieres
            ->findAll();

SELECT `comptes`.*, `roles`.`role_type`
FROM `comptes`
JOIN `roles` ON `roles`.`role_id` = `comptes`.`role_id`
WHERE `compte_id` = '38'
 LIMIT 1
---
    public function getCompteWithRole($compte_id)
    {
        return $this->select('comptes.*, roles.role_type, departements.departement_name, filieres.filiere_name')
            ->join('roles', 'roles.role_id = comptes.role_id', 'left')
            ->join('departements', 'departements.departement_id = comptes.departement_id', 'left') // Correction pour departements
            ->join('filieres', 'filieres.filiere_id = comptes.filiere_id', 'left') // Correction pour filieres
            ->where('comptes.compte_id', $compte_id)
            ->first();

SELECT `comptes`.*, `roles`.`role_type`
FROM `comptes`
JOIN `roles` ON `roles`.`role_id` = `comptes`.`role_id`
WHERE `roles`.`role_type` = 'prof'
ORDER BY `comptes`.`compte_id` DESC
 LIMIT 3
---
    public function getLatestStudents()
    {
        return $this->select('comptes.*, roles.role_type, departements.departement_name, filieres.filiere_name')
            ->join('roles', 'roles.role_id = comptes.role_id', 'left')
            ->join('departements', 'departements.departement_id = comptes.departement_id', 'left') // Correction pour departements
            ->join('filieres', 'filieres.filiere_id = comptes.filiere_id', 'left') // Correction pour filieres
            ->where('roles.role_type', 'etd')
            ->orderBy('comptes.compte_id', 'DESC')
            ->limit(3)
            ->findAll();