app/Models/compteModel.php

SELECT `comptes`.*, `roles`.`role_type`
FROM `comptes`
LEFT JOIN `roles` ON `roles`.`role_id` = `comptes`.`role_id`
---
    public function getAllComptesWithRoles()
    {
        // Effectuer une jointure avec la table `roles` pour récupérer les rôles
        return $this->select('comptes.*, roles.role_type')
            ->join('roles', 'roles.role_id = comptes.role_id', 'left') // Join pour récupérer le type de rôle
            ->findAll();