app/Models/examModel.php

SELECT `filiere_id`
FROM `comptes`
WHERE `user_id` = '37'
SELECT `exams`.`exam_id`, `exams`.`module`, `exams`.`exam_date`
FROM `exams`
WHERE `exams`.`filiere_id` = '1'
AND `exams`.`exam_date` >= '2025-01-23'
ORDER BY `exams`.`exam_date` ASC
---
    public function getUpcomingExams($user_id)
    {
        // Récupère le 'filiere_id' de l'utilisateur
        $filiere_id = $this->db->table('comptes')
        ->select('filiere_id')
        ->where('user_id', $user_id)
            ->get()
            ->getRow()
            ->filiere_id;

        // Filtre les examens en fonction de la filière de l'utilisateur et de la date actuelle
        return $this->db->table('exams')
        ->select('exams.exam_id, exams.module, exams.exam_date') // Sélectionner explicitement les champs nécessaires
        ->where('exams.filiere_id', $filiere_id)
            ->where('exams.exam_date >=', date('Y-m-d'))
            ->orderBy('exams.exam_date', 'ASC')
            ->get()
            ->getResultArray();