app/Models/noteModel.php

    public function getRecentResults($student_id)
    {
        return $this->db->table('notes')
            ->select('notes.note, notes.exam_id, exams.module, exams.exam_date')
            ->join('exams', 'notes.exam_id = exams.exam_id')
            ->where('notes.student_id', $student_id)
            ->orderBy('notes.note', 'DESC')
            ->limit(5) // Limite à 5 résultats récents
            ->get()
            ->getResult();
---
SELECT `notes`.`note`, `notes`.`exam_id`, `exams`.`module`, `exams`.`exam_date`
FROM `notes`
JOIN `exams` ON `notes`.`exam_id` = `exams`.`exam_id`
WHERE `notes`.`student_id` = '37'
ORDER BY `notes`.`note` DESC
 LIMIT 5