app/Models/reclamationModel.php

    public function getAllReclamations()
    {
        return $this->db->table($this->table)
            ->select('reclamations.*, comptes.first_name, comptes.last_name')
            ->join('comptes', 'comptes.compte_id = reclamations.student_id')
            ->get()
            ->getResultArray();
---
SELECT `reclamations`.*, `comptes`.`first_name`, `comptes`.`last_name`
FROM `reclamations`
JOIN `comptes` ON `comptes`.`compte_id` = `reclamations`.`student_id`